Repository: yuyu22300032/FeedYu
Catalog: FeedYu/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh_hant

source: %.1f km away (straight line)
ja: 直線距離 %.1f km
zh_hant: 直線距離 %.1f 公里

source: %@ straight line
ja: 直線距離 %@
zh_hant: 直線距離 %@

source: %lld hidden
ja: 非表示 %lld 件
zh_hant: 已隱藏 %lld 間

source: %lld min drive
ja: 車で %lld 分
zh_hant: 開車 %lld 分鐘

source: %lld min in current traffic
ja: 現在の交通状況で %lld 分
zh_hant: 目前路況下 %lld 分鐘

source: %lld min on foot
ja: 徒歩約 %lld 分
zh_hant: 步行約 %lld 分鐘

source: %lld min walk
ja: 徒歩 %lld 分
zh_hant: 步行 %lld 分鐘

source: %lld places
ja: %lld 件
zh_hant: %lld 個地點

source: 1 MICHELIN Star
ja: ミシュラン一つ星
zh_hant: 米其林一星

source: 2 MICHELIN Stars
ja: ミシュラン二つ星
zh_hant: 米其林二星

source: 3 MICHELIN Stars
ja: ミシュラン三つ星
zh_hant: 米其林三星

source: A friend sends their list link in a chat
ja: 友達がチャットでリストのリンクを送ってくる
zh_hant: 朋友在聊天室傳來清單連結

source: Add
ja: 追加
zh_hant: 新增

source: Add a Google Maps shared list
ja: Google マップの共有リストを追加
zh_hant: 新增 Google 地圖共享清單

source: Add a shared Google Maps list link or import your Google Takeout in the Settings tab.
ja: 「設定」タブで Google マップの共有リストのリンクを追加するか、Google Takeout データを読み込んでください。
zh_hant: 請在「設定」分頁加入 Google 地圖共享清單連結，或匯入 Google Takeout 資料。

source: Add list
ja: リストを追加
zh_hant: 加入清單

source: Add restaurant
ja: レストランを追加
zh_hant: 新增餐廳

source: Added %lld shared list(s) — syncing now. Name and manage them in Settings.
ja: %lld 件の共有リストを追加し、同期しています。名前の設定や管理は設定画面でどうぞ。
zh_hant: 已加入 %lld 個共享清單，正在同步。可到設定中命名與管理。

source: Address (used to find coordinates)
ja: 住所（座標の取得に使用）
zh_hant: 地址（用於取得座標）

source: Apple Maps is rate-limiting drive-time checks. Wait a minute and refresh.
ja: Apple マップが所要時間チェックを制限しています。1分ほど待って再試行してください。
zh_hant: Apple 地圖暫時限制車程查詢。請稍候一分鐘再重新整理。

source: Bib
ja: ビブ
zh_hant: 必比登

source: Bib Gourmand
ja: ビブグルマン
zh_hant: 必比登推介

source: Bring your Google Maps lists
ja: Google マップのリストを取り込む
zh_hant: 匯入你的 Google 地圖清單

source: Bundled michelin.csv is missing.
ja: 内蔵の michelin.csv が見つかりません。
zh_hant: 找不到內建的 michelin.csv。

source: Cancel
ja: キャンセル
zh_hant: 取消

source: Checking Uber Eats availability…
ja: Uber Eats の取扱いを確認中…
zh_hant: 正在查詢 Uber Eats 供應狀況…

source: Checking drive times…
ja: 運転時間を確認中…
zh_hant: 正在查詢車程時間…

source: Choose Share list, then FeedYu
ja: 「リストを共有」→ FeedYu を選ぶ
zh_hant: 選「分享清單」，再選 FeedYu

source: Continue
ja: 次へ
zh_hant: 繼續

source: Could not parse the bundled Michelin dataset.
ja: 内蔵ミシュランデータセットを解析できませんでした。
zh_hant: 無法解析內建的米其林資料集。

source: Couldn't check drive time for some places (network?).
ja: 一部のお店の運転時間を確認できませんでした（ネットワーク？）。
zh_hant: 部分地點無法查詢車程（網路問題？）。

source: Couldn't find coordinates — saved without location (excluded from distance filtering).
ja: 座標が見つかりませんでした — 位置情報なしで保存しました(距離フィルタの対象外)。
zh_hant: 找不到座標——已儲存但無位置（不列入距離篩選）。

source: Couldn't read %@.
ja: %@ を読み込めませんでした。
zh_hant: 無法讀取 %@。

source: Counts as
ja: 分類
zh_hant: 視為

source: Current guide
ja: 現行ガイド
zh_hant: 目前名單

source: Custom list
ja: カスタムリスト
zh_hant: 自訂清單

source: Dataset date
ja: データ日付
zh_hant: 資料日期

source: Decrease budget
ja: 上限を減らす
zh_hant: 減少預算

source: Delete
ja: 削除
zh_hant: 刪除

source: Distance
ja: 距離
zh_hant: 距離

source: Drive
ja: 車
zh_hant: 開車

source: Each list feeds the Tonight and Uber Eats tabs independently — toggle either off without deleting anything (handy for trying out a friend's list). Removing a list also deletes its places, except ones on another list, added manually, or in the Michelin guide.
ja: 各リストは「今晩」タブと「Uber Eats」タブで別々に利用できます。どちらのスイッチをオフにしても何も削除されません（友達のリストを試すときに便利）。リストを削除するとその店も削除されますが、他のリストにも含まれる店、手動で追加した店、ミシュランガイドの店は残ります。
zh_hant: 每個清單可分別供「今晚」與「Uber Eats」分頁使用——關閉任一開關都不會刪除任何內容（試用朋友的清單時很方便）。移除清單會一併刪除其中的店家，但同時屬於其他清單、手動新增或米其林指南中的店家除外。

source: Enable location access to see Michelin restaurants within your drive-time budget.
ja: 位置情報を許可すると、運転時間内のミシュランレストランが表示されます。
zh_hant: 允許定位後，即可查看車程範圍內的米其林餐廳。

source: FeedYu filters suggestions by drive time from where you are. Allow location access in the Settings app.
ja: FeedYu は現在地からの運転時間でおすすめを絞り込みます。「設定」アプリで位置情報へのアクセスを許可してください。
zh_hant: FeedYu 會依你目前位置的車程時間篩選建議。請在「設定」App 中允許取用定位。

source: FeedYu imports it the next time it opens
ja: 次に FeedYu を開くと自動で取り込まれます
zh_hant: 下次打開 FeedYu 時會自動匯入

source: Find your list and tap its ⋯ button
ja: リストを見つけて右の「…」をタップ
zh_hant: 找到你的清單，點右邊的「⋯」

source: Finding your location…
ja: 現在地を取得中…
zh_hant: 正在取得你的位置…

source: Former
ja: 掲載終了
zh_hant: 已離榜

source: Former: %@
ja: 掲載終了（%@）
zh_hant: 已離榜（%@）

source: Get started
ja: はじめる
zh_hant: 開始使用

source: Google Maps
ja: Google マップ
zh_hant: Google 地圖

source: Google Maps shared lists
ja: Google マップ共有リスト
zh_hant: Google 地圖共享清單

source: Google Takeout import
ja: Google Takeout 読み込み
zh_hant: Google Takeout 匯入

source: Guide
ja: ガイド
zh_hant: 名單

source: Hidden (%lld)
ja: 非表示（%lld）
zh_hant: 已隱藏（%lld）

source: Hide
ja: 非表示
zh_hant: 隱藏

source: Hide this restaurant
ja: このレストランを非表示
zh_hant: 隱藏這間餐廳

source: How it works
ja: 使い方
zh_hant: 使用方式

source: How to use FeedYu
ja: FeedYu の使い方
zh_hant: 如何使用 FeedYu

source: Import Saved Places.json (Starred)
ja: Saved Places.json を読み込み（スター付き）
zh_hant: 匯入 Saved Places.json（已加星號）

source: Import a friend's list
ja: 友達のリストを取り込む
zh_hant: 匯入朋友分享的清單

source: Import a list CSV (Want to go…)
ja: リスト CSV を読み込み（行きたい…）
zh_hant: 匯入清單 CSV（想去…）

source: Import failed: %@
ja: 読み込み失敗：%@
zh_hant: 匯入失敗：%@

source: Imported %lld places from %@.
ja: %2$@ から %1$lld 件を読み込みました。
zh_hant: 已從 %2$@ 匯入 %1$lld 個地點。

source: Importing %@…
ja: %@ を読み込み中…
zh_hant: 正在匯入 %@…

source: In Google Maps, tap You at the bottom
ja: Google マップで下部の「あなた」をタップ
zh_hant: 在 Google 地圖點底部的「你」

source: In Google Maps: your list → Share → copy the link. Starred places can't be shared — import them via Takeout below. If Google changes their page format, sync fails here but the app keeps your last data.
ja: Google マップで：リスト → 共有 → リンクをコピー。スター付きの場所は共有できないため、下の Takeout で読み込んでください。Google がページ形式を変更すると同期は失敗しますが、アプリには前回のデータが残ります。
zh_hant: 在 Google 地圖中：你的清單 → 分享 → 複製連結。已加星號的地點無法共享——請用下方的 Takeout 匯入。若 Google 更改頁面格式，同步會失敗，但 App 仍會保留上次的資料。

source: In Google Maps: your list → Share → send it to FeedYu, or copy the link and paste it here. Starred places can't be shared — import them via Takeout below. If Google changes their page format, sync fails here but the app keeps your last data.
ja: Google マップで：リスト → 共有 → FeedYu に送るか、リンクをコピーしてここに貼り付けます。スター付きの場所は共有できないため、下の Takeout からインポートしてください。Google がページ形式を変更すると同期は失敗しますが、前回のデータは保持されます。
zh_hant: 在 Google 地圖：你的清單 → 分享 → 直接傳給 FeedYu，或複製連結貼到這裡。已加星號的地點無法分享——請用下方的 Takeout 匯入。若 Google 更改頁面格式，這裡的同步會失敗，但 App 會保留你上次的資料。

source: Include former
ja: 過去の掲載も含む
zh_hant: 含歷年入選

source: Increase budget
ja: 上限を増やす
zh_hant: 增加預算

source: Label (optional)
ja: ラベル（任意）
zh_hant: 名稱（選填）

source: Language
ja: 言語
zh_hant: 語言

source: Last sync: %@ · %lld places
ja: 前回の同期：%@ · %lld 件
zh_hant: 上次同步：%@ · %lld 個地點

source: List name
ja: リスト名
zh_hant: 清單名稱

source: List type for CSV
ja: CSV リストの種類
zh_hant: CSV 清單類型

source: Local language
ja: 現地語
zh_hant: 當地語言

source: Location needed
ja: 位置情報が必要です
zh_hant: 需要定位權限

source: Manage & add restaurants
ja: レストランの管理と追加
zh_hant: 管理與新增餐廳

source: Manual
ja: 手動
zh_hant: 手動

source: Michelin
ja: ミシュラン
zh_hant: 米其林

source: Michelin Selected
ja: ミシュランセレクテッド
zh_hant: 米其林入選

source: Michelin data
ja: ミシュランデータ
zh_hant: 米其林資料

source: Name
ja: 名前
zh_hant: 名稱

source: No Michelin places match the filters within %@.
ja: %@ 圏内に条件に合うミシュランの場所がありません。
zh_hant: %@ 內沒有符合篩選條件的米其林地點。

source: No lists yet? The Michelin tab works instantly
ja: リストがなくても、ミシュランタブはすぐ使えます
zh_hant: 還沒有清單？米其林分頁馬上就能用

source: No location
ja: 位置情報なし
zh_hant: 無座標

source: No places found in the file.
ja: ファイル内に場所が見つかりません。
zh_hant: 檔案中找不到任何地點。

source: No places found in the page — Google may have changed the format, or the list is empty/not public.
ja: ページ内に場所が見つかりません — Google が形式を変更したか、リストが空／非公開の可能性があります。
zh_hant: 頁面中找不到任何地點——Google 可能更改了格式，或清單為空／未公開。

source: No restaurants within roughly %@ of you. Try a bigger budget or add more places.
ja: およそ %@ 圏内にレストランがありません。上限を広げるか、場所を追加してみてください。
zh_hant: 你附近約 %@ 內沒有餐廳。試著放寬預算或加入更多地點。

source: No rows with a Title column found — is this a Takeout list CSV?
ja: Title 列を持つ行が見つかりません — これは Takeout のリスト CSV ですか？
zh_hant: 找不到含 Title 欄位的資料列——這是 Takeout 清單 CSV 嗎？

source: No saved restaurants yet
ja: 保存済みのレストランがありません
zh_hant: 尚未儲存任何餐廳

source: Not a Saved Places GeoJSON file.
ja: Saved Places の GeoJSON ファイルではありません。
zh_hant: 這不是 Saved Places 的 GeoJSON 檔案。

source: Not a valid URL: %@
ja: 無効な URL：%@
zh_hant: 無效的網址：%@

source: Not feeling it — another
ja: ピンとこない — 別のお店
zh_hant: 不太想吃這間——換一間

source: Not feeling the pick? Tap for another
ja: ピンとこなければワンタップで次へ
zh_hant: 不想吃這家？一鍵換一間

source: Nothing new within %@ so far — refresh to keep looking.
ja: 今のところ %@ 圏内に新しい場所はありません。更新して探し続けてください。
zh_hant: 目前 %@ 內沒有新的地點——再按一次繼續找。

source: Nothing reachable within %@ right now.
ja: 現在、%@ 圏内に行ける場所がありません。
zh_hant: 目前 %@ 內沒有可到達的地點。

source: On the Michelin list: %@
ja: ミシュラン掲載年：%@
zh_hant: 米其林上榜年份：%@

source: Open Google Maps
ja: Google マップを開く
zh_hant: 打開 Google 地圖

source: Open Settings
ja: 設定を開く
zh_hant: 打開設定

source: Open in Google Maps
ja: Google マップで開く
zh_hant: 在 Google 地圖中開啟

source: Order on Uber Eats
ja: Uber Eats で注文
zh_hant: 在 Uber Eats 訂餐

source: Paste a maps.app.goo.gl share link
ja: maps.app.goo.gl の共有リンクを貼り付け
zh_hant: 貼上 maps.app.goo.gl 分享連結

source: Places in dataset
ja: データ件数
zh_hant: 資料集餐廳數

source: Places only on this list are deleted. Places that are also on another list, added manually, or in the Michelin guide are kept.
ja: このリストだけにある場所は削除されます。他のリストにもある場所、手動で追加した場所、ミシュランガイド掲載の場所は残ります。
zh_hant: 只在這個清單上的地點會被刪除。同時在其他清單上、手動加入、或列於米其林指南的地點會保留。

source: Press and hold the link
ja: リンクを長押し
zh_hant: 長按那個連結

source: Price bands — none selected means any price
ja: 価格帯 — 未選択はすべての価格
zh_hant: 價位區間——未選擇表示不限

source: Quit app now to apply
ja: 今すぐアプリを終了して適用
zh_hant: 立即關閉 App 以套用

source: Refresh from GitHub now
ja: GitHub から今すぐ更新
zh_hant: 立即從 GitHub 更新

source: Refreshing…
ja: 更新中…
zh_hant: 更新中…

source: Remote Michelin CSV parsed to only %lld rows — format may have changed.
ja: リモートのミシュラン CSV は %lld 行しか解析できませんでした — 形式が変わった可能性があります。
zh_hant: 遠端米其林 CSV 只解析出 %lld 列——格式可能已變更。

source: Remove list
ja: リストを削除
zh_hant: 移除清單

source: Remove list and its places
ja: リストとその場所を削除
zh_hant: 移除清單與其中的地點

source: Remove “%@”?
ja: 「%@」を削除しますか？
zh_hant: 要移除「%@」嗎？

source: Rename list
ja: リスト名を変更
zh_hant: 重新命名清單

source: Restaurant name language
ja: レストラン名の言語
zh_hant: 餐廳名稱語言

source: Restaurants
ja: レストラン
zh_hant: 餐廳

source: Save
ja: 保存
zh_hant: 儲存

source: Search restaurants
ja: レストランを検索
zh_hant: 搜尋餐廳

source: Seen everything in range — starting the rotation over.
ja: 範囲内をすべて表示しました — 最初からやり直します。
zh_hant: 範圍內的都看過了——重新開始輪替。

source: Selected
ja: セレクト
zh_hant: 入選

source: Server returned HTTP %lld.
ja: サーバーが HTTP %lld を返しました。
zh_hant: 伺服器回應 HTTP %lld。

source: Set how far you'll go — walk, drive, or distance
ja: 徒歩・車・距離で「どこまで行けるか」を設定
zh_hant: 設定你願意跑多遠——步行、開車或距離

source: Settings
ja: 設定
zh_hant: 設定

source: Share it to FeedYu — done
ja: FeedYu に共有すれば完了
zh_hant: 分享給 FeedYu 就完成

source: Shared list
ja: 共有リスト
zh_hant: 共享清單

source: Shared lists
ja: 共有リスト
zh_hant: 共享清單

source: Starred
ja: スター付き
zh_hant: 已加星號

source: Stars + Bib Gourmand from the open michelin-my-maps dataset. Auto-refreshes weekly; falls back to the bundled snapshot when offline.
ja: 星付きとビブグルマンはオープンな michelin-my-maps データセットから。毎週自動更新、オフライン時は内蔵スナップショットを使用します。
zh_hant: 星級與必比登資料來自開源 michelin-my-maps 資料集。每週自動更新；離線時使用內建快照。

source: Suggest a place
ja: お店を提案
zh_hant: 推薦一間

source: Suggest a restaurant
ja: レストランを提案
zh_hant: 隨機推薦餐廳

source: Sync now
ja: 今すぐ同期
zh_hant: 立即同步

source: System default
ja: システムのデフォルト
zh_hant: 系統預設

source: Takeout import
ja: Takeout インポート
zh_hant: Takeout 匯入

source: Takeout: Saved Places (Starred)
ja: Takeout：Saved Places（スター付き）
zh_hant: Takeout：Saved Places（已加星號）

source: Takes effect after the app restarts. Restaurant names from your Google lists follow this language — run Sync now afterwards to re-fetch them.
ja: アプリの再起動後に有効になります。Google リストのレストラン名はこの言語に従います — 変更後に「今すぐ同期」を実行してください。
zh_hant: 重新啟動 App 後生效。Google 清單中的餐廳名稱會跟隨此語言——變更後請按「立即同步」重新取得。

source: Tonight
ja: 今夜
zh_hant: 今晚

source: Tonight's pick — from your own saved restaurants, close enough to actually go.
ja: あなたが保存したお店の中から、今夜ほんとうに行ける一軒を。
zh_hant: 從你自己收藏的餐廳裡，挑出今晚真的到得了的那一家。

source: Unhide
ja: 再表示
zh_hant: 取消隱藏

source: View in Michelin Guide
ja: ミシュランガイドで見る
zh_hant: 在米其林指南查看

source: Walk
ja: 徒歩
zh_hant: 步行

source: Want to go
ja: 行きたい
zh_hant: 想去

source: Welcome to FeedYu
ja: FeedYu へようこそ
zh_hant: 歡迎使用 FeedYu

source: Within %@ (%lld)
ja: %@ 圏内（%lld）
zh_hant: %@ 內（%lld）

source: You've reached %lld lists — delete one before adding another.
ja: リストは最大 %lld 件です。追加するには先にいずれかを削除してください。
zh_hant: 已達 %lld 個清單上限——請先刪除一個再新增。

source: You've reached %lld lists — delete one in Settings, then share the link again.
ja: リストは最大 %lld 件です。設定でいずれかを削除してから、もう一度リンクを共有してください。
zh_hant: 已達 %lld 個清單上限——請先在設定中刪除一個，再重新分享連結。

source: Your lists (%lld/%lld)
ja: マイリスト（%lld/%lld）
zh_hant: 你的清單（%lld/%lld）

source: Your places (%lld)
ja: マイプレイス（%lld）
zh_hant: 你的地點（%lld）

source: Your restaurants
ja: マイレストラン
zh_hant: 你的餐廳

source: bundled snapshot %@
ja: 内蔵スナップショット %@
zh_hant: 內建快照 %@

source: takeout.google.com → deselect all → select “Maps (your places)” and “Saved”. Unzip the archive first, then pick Saved Places.json or a list CSV here. CSV rows have no coordinates — FeedYu resolves them from the place link or by geocoding, which can take a minute.
ja: takeout.google.com → すべて選択解除 → 「マップ（あなたの場所）」と「保存済み」を選択。アーカイブを解凍してから、ここで Saved Places.json またはリスト CSV を選んでください。CSV に座標はありません — FeedYu が場所リンクやジオコーディングで解決します（少し時間がかかります）。
zh_hant: takeout.google.com → 全部取消選取 → 勾選「地圖（你的地點）」與「已儲存」。請先解壓縮封存檔，再在此選擇 Saved Places.json 或清單 CSV。CSV 內沒有座標——FeedYu 會從地點連結或地理編碼解析，可能需要一點時間。

source: %.1f km
zh_hant: %.1f 公里

source: OK
zh_hant: 好
